; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-12)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room4)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 7 of 12
2. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 7 of 12
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 12
4. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 8 of 12
5. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 9 of 12
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 9 of 12
7. (pick ball7 roomb right)
   deleted: (at ball7 roomb) (free right)
   added: (carry ball7 right)
   goals met: 9 of 12
8. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 9 of 12
9. (drop ball7 room3 right)
   deleted: (carry ball7 right)
   added: (at ball7 room3) (free right)
   goals met: 10 of 12
10. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 11 of 12
11. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 11 of 12
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 12
13. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 11 of 12
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 12
15. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 12 of 12
